
;; #+LATEX_HEADER: \input{lib.tex}

* other
| C-x z | repeat last cmd |
|       |                 |



#+begin_src  C++
int main() {
  return 0;
}
#+end_src

#+results:
: 2

#+begin_src erlang
  %% A process whose only job is to keep a counter.

  -module(counter).
  -export([start/0, codeswitch/1]).

  start() -> loop(0).

  loop(Sum) ->
    receive
       {increment, Count} ->
          loop(Sum+Count);
       reset ->
          loop(0);
       {counter, Pid} ->
          Pid ! {counter, Sum},
          loop(Sum);
       code_switch ->
          ?MODULE:codeswitch(Sum)
    end.

  codeswitch(Sum) -> loop(Sum).
#+end_src
